Autodesk.Revit.DB.Leader
A leader object that can be attached to annotation elements such as text notes.
Remarks:
For information on how to attach or get leaders to/from a text annotation
refer to corresponding methods of Autodesk.Revit.DB.TextNote class.